ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/include/cy_mxsdiodev.h
/***************************************************************************//**
* \file cy_mxsdiodev.h
* \version 1.0
*
* This file provides an API declaration of the MXSDIODEV driver
*
********************************************************************************
* \copyright
* Copyright 2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_sdio_dev
* \{
* **MXSDIODEV**: The SDIO 3.0 Device (mxsdiodev) is a IP core that has been
* previously integrated in many of Cypress's WLAN Chip tapeouts. The IP is designed to mate
* with standards compliant to SDIO Host. SDIO Device has in built DMA for external host communication.
* 
* - Supports SDIO version 3.0 including the new UHS-I modes
*    - DS: Default speed (DS) up to 25 MHz, including 1- and 4-bit modes (3.3V signaling).
*    - HS: High-speed up to 50 MHz (3.3V signaling).
*    - SDR12: SDR up to 25 MHz (1.8V signaling).
*    - SDR25: SDR up to 50 MHz (1.8V signaling).
*    - SDR50: SDR up to 100 MHz (1.8V signaling).
* - Backwards compatible with SDIO 2.0 Hosts
* - The following three functions are supported:
*   - Function 0 Standard SDIO function (max. BlockSize/ByteCount = 32B)
*   - Function 1 Backplane Function to access the internal SoC address space (max. BlockSize/ByteCount = 64B)
*   - Function 2 WLAN Function for efficient WLAN packet transfer through DMA (max. BlockSize/ByteCount = 512B)
* - AHB Lite DMA capable Master
* - AHB Lite Slave for MMIO programming
*
* Host software uses Function 2 to Read and Write framed data from/to the sdio device.
*
* \section group_sdio_dev_more_information More Information
* For more information on the SDIO Device, refer to the technical reference manual (TRM).
*
* \section group_sdio_dev_MISRA MISRA-C Compliance
* The SDIO Device driver does not have any specific deviations.
*
* \section group_sdio_dev_Changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_sdio_dev_macros_general_purpose General Purpose Macros
* \defgroup group_sdio_dev_macros Macros
* \defgroup group_sdio_dev_functions Functions
* \defgroup group_sdio_dev_interrupt_functions Interrupt
* \defgroup group_sdio_dev_data_structures Data Structures
* \defgroup group_sdio_dev_enums Enumerated Types
*/
#if !defined (CY_MXSDIODEV_H)
#define CY_MXSDIODEV_H

#include "cy_device.h"

#if defined (CY_IP_MXSDIODEV)

#include <stddef.h>
#include "cy_syslib.h"

#if defined(__cplusplus)
extern "C" {
#endif

/**
* \addtogroup group_sdio_dev_macros_general_purpose
* \{
*/

/** Driver major version */
#define CY_SDIO_DEV_DRV_VERSION_MAJOR       1

/** Driver minor version */
#define CY_SDIO_DEV_DRV_VERSION_MINOR       0

/** DMA Channel */
#define MXSDIODEV_DMA_CHANNEL                0

/******************************************************************************
* API Constants
******************************************************************************/

/** SDIO Device ID */
#define CY_SDIO_DEV_ID                         (CY_PDL_DRV_ID(0x51U))

/** Manufacturer ID Size in tuples (2 bytes)*/
#define CY_SDIO_DEV_MANFID_SIZE                (3)        

/** Frame tag length */
#define CY_SDIO_DEV_FRAMETAG_LEN            (4)

/* rx header flags */
/** CRC error detected */
#define RXF_CRC        0x0001
/** write frame out of sync */
#define RXF_WOOS    0x0002        
/** write frame terminated */
#define RXF_WF_TERM    0x0004      
/** write frame aborted */  
#define RXF_ABORT    0x0008        
/** bad frame */
#define RXF_DISCARD    (RXF_CRC | RXF_WOOS | RXF_WF_TERM | RXF_ABORT)    

/**
* \defgroup group_sdio_dev_macros_callback_events SDIO Device Callback Events
* \{
* Macros to check SDIO events passed by \ref cy_cb_sdio_dev_handle_events_t callback.
* Each event is encoded in a separate bit, and therefore it is possible to
* notify about multiple events.
*/

/**
* Indicates the slave read packet from master
*/
#define CY_SDIO_DEV_RECEIVE_CMPLT_EVENT        (0x00000010UL)

/**
* Indicates the slave transmitted packet
*/
#define CY_SDIO_DEV_TRANSMIT_CMPLT_EVENT        (0x00000020UL)

/**
* Indicates the receive packet error
*/
#define CY_SDIO_DEV_RECEIVE_PKT_ERROR             (0x00000030UL)

/** \} group_sdio_dev_macros_callback_events */

/** \cond INTERNAL */

#define CY_SDIO_DEV_RETRY_TIME                (1000UL) /* The number loops to make the timeout in msec. */
#define CY_SDIO_DEV_TIMEOUT_MS                (3U)     /* The Command complete timeout. */

/* Interrupt Status */
#define    I_ERRORS            (MXSDIO_INTSTATUS_DESCERR_Msk | \
                             MXSDIO_INTSTATUS_RCVDESCUF_Msk | \
                             MXSDIO_INTSTATUS_RCVFIFOOF_Msk | \
                             MXSDIO_INTSTATUS_XMTFIFOUF_Msk)    /** DMA Errors */

/* Default Interrupt mask */
#define DEF_INTMASK            (I_ERRORS | \
                             MXSDIO_INTSTATUS_TOSBMAIL_Msk | \
                             MXSDIO_INTSTATUS_RCVINT_Msk | \
                             MXSDIO_INTSTATUS_XMTINT_Msk | \
                             MXSDIO_INTSTATUS_RDOUTOFSYNC_Msk)

#define DEF_SDIO_INTMASK    (DEF_INTMASK | \
                             MXSDIO_INTSTATUS_SRESET_Msk | \
                             MXSDIO_INTSTATUS_IOE2CHANGE_Msk)

