ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/include/cy_mxsdiodev.h
/* tohostmailbox bits corresponding to intstatus bits */
#define HMB_INT_ACK    (1 << 0)    /* To Host Mailbox Dev Interrupt ACK */
#define HMB_FRAME_IND    (1 << 2)    /* To Host Mailbox Frame Indication */
#define HMB_HOST_INT    (1 << 3)    /* To Host Mailbox Miscellaneous Interrupt */
#define HMB_MASK    0x0000000f    /* To Host Mailbox Mask */

/* Descriptor control flags 1 */
#define D64_CTRL_COREFLAGS    0x0ff00000    /* core specific flags */
#define    D64_CTRL1_NOTPCIE    ((uint32)1 << 18)    /* buirst size control */
#define    D64_CTRL1_EOT        ((uint32)1 << 28)    /* end of descriptor table */
#define    D64_CTRL1_IOC        ((uint32)1 << 29)    /* interrupt on completion */
#define    D64_CTRL1_EOF        ((uint32)1 << 30)    /* end of frame */
#define    D64_CTRL1_SOF        ((uint32)1 << 31)    /* start of frame */

/* Descriptor control flags 2 */
#define D64_CTRL2_BC_USABLE_MASK    0x00003fff  /* buffer byte count. real data len must <= 16KB */
#define    D64_CTRL2_BC_MASK    0x00007fff    /* buffer byte count. real data len must <= 16KB */
#define    D64_CTRL2_AE        0x00030000    /* address extension bits */
#define    D64_CTRL2_AE_SHIFT    16
#define D64_CTRL2_PARITY    0x00040000      /* parity bit */

/** \endcond */

/** \endcond */

/** \} group_sdio_dev_macros_general_purpose */

/**
* \addtogroup group_sdio_dev_enums
* \{
*/

/******************************************************************************
 * Enumerations
 *****************************************************************************/
 
/** SDIO Device error codes. */
typedef enum 
{
    CY_SDIO_DEV_SUCCESS                     = 0U,  /**< Successful. */
    CY_SDIO_DEV_ERROR                       = CY_SDIO_DEV_ID | CY_PDL_STATUS_ERROR | 1U,  /**< Non-specific error code. */
    CY_SDIO_DEV_ERROR_INVALID_PARAMETER     = CY_SDIO_DEV_ID | CY_PDL_STATUS_ERROR | 2U,  /**< The provided parameter is not valid. */
    CY_SDIO_DEV_ERROR_OPERATION_IN_PROGRESS = CY_SDIO_DEV_ID | CY_PDL_STATUS_ERROR | 3U,  /**< A conflicting or requested operation is still in progress. */
    CY_SDIO_DEV_ERROR_UNINITIALIZED         = CY_SDIO_DEV_ID | CY_PDL_STATUS_ERROR | 4U,  /**< The module (or part of it) was not initialized properly. */
    CY_SDIO_DEV_ERROR_TIMEOUT               = CY_SDIO_DEV_ID | CY_PDL_STATUS_ERROR | 5U,  /**< A Time Out error occurred */
    CY_SDIO_DEV_OPERATION_INPROGRESS        = CY_SDIO_DEV_ID | CY_PDL_STATUS_ERROR | 6U,  /**< The indicator for operation in progress. */
    CY_SDIO_DEV_ERROR_UNUSABLE_CARD         = CY_SDIO_DEV_ID | CY_PDL_STATUS_ERROR | 7U,  /**< The card is unusable. */
    CY_SDIO_DEV_ERROR_DISCONNECTED          = CY_SDIO_DEV_ID | CY_PDL_STATUS_ERROR | 8U   /**< The card is disconnected. */
} cy_en_sdio_dev_status_t;

/** DMA transmit state. */
typedef enum 
{
    CY_SDIO_DEV_XS_DISABLED,    /**< disabled */
    CY_SDIO_DEV_XS_ACTIVE,        /**< active */
    CY_SDIO_DEV_XS_IDLE,        /**< idle wait */
    CY_SDIO_DEV_XS_STOPPED,        /**< stopped */
    CY_SDIO_DEV_XS_SUSP            /**< suspend pending */
} cy_en_sdio_dev_transmit_state_t;

/** DMA receive state. */
typedef enum 
{
    CY_SDIO_DEV_RS_DISABLED,    /**< disabled */
    CY_SDIO_DEV_RS_ACTIVE,        /**< active */
    CY_SDIO_DEV_RS_IDLE,        /**< idle wait */
    CY_SDIO_DEV_RS_STOPPED,        /**< stopped */
    CY_SDIO_DEV_RS_SUSP            /**< suspend pending */
} cy_en_sdio_dev_receive_state_t;

/** SDIO Device Manufacturer ID configuration. */
typedef enum 
{
    CY_SDIO_DEV_USE_DEFAULT_MANF_ID                     = 0U,  /**< Use default manufacturer ID from CIS area. */
    CY_SDIO_DEV_USER_PROVIDED_MANF_ID                   = 1U,  /**< Use user provided manufacture ID from config structure. */
} cy_en_sdio_dev_manf_id_config_t;

/** SDIO Device VERSION */
typedef enum 
{
    CY_SDIO_DEV_VERSION_3_0                     = 0U,  /**< Use SDIO Version 3.0. */
    CY_SDIO_DEV_VERSION_2_0                     = 1U,  /**< Use SDIO Version 2.0. */
} cy_en_sdio_dev_ver_config_t;

/** SDIO Device Block Size */
typedef enum 
{
    CY_SDIO_DEV_BLK_SIZE_512                     = 0U,  /**< Use F2 Block Size as 512 bytes. */
    CY_SDIO_DEV_BLK_SIZE_256                     = 1U,  /**< Use F2 Block Size as 256 bytes. */
    CY_SDIO_DEV_BLK_SIZE_128                     = 2U,  /**< Use F2 Block Size as 128 bytes. */
    CY_SDIO_DEV_BLK_SIZE_64                      = 3U,  /**< Use F2 Block Size as 64 bytes. */
} cy_en_sdio_dev_blk_size_config_t;

/** SDIO Device Max Speed */
typedef enum 
{
    CY_SDIO_DEV_SDR12                     = 0U,  /**< SDR12 - Max Clock Frequency 25 Mhz. */
    CY_SDIO_DEV_SDR25                     = 1U,  /**< SDR25 - Max Clock Frequency 50 Mhz. */
    CY_SDIO_DEV_SDR50                     = 2U,  /**< SDR50 - Max Clock Frequency 100 Mhz. */
    CY_SDIO_DEV_SDR104                    = 3U,  /**< SDR104 - Max Clock Frequency 208 Mhz. */
    CY_SDIO_DEV_DDR50                     = 4U,  /**< DDR50 - Max Clock Frequency 50 Mhz. */
} cy_en_sdio_dev_max_speed_config_t;

/** \} group_sdio_dev_enums */

/**
* \addtogroup group_sdio_dev_data_structures
* \{
*/

/**
* Provides the typedef for the callback function called in the
* \ref Cy_SDIO_DEV_Interrupt to notify the user about occurrences of
* \ref group_sdio_dev_macros_callback_events.
*/
typedef void (* cy_cb_sdio_dev_handle_events_t)(uint32_t event);

/** \} group_sdio_dev_data_structures */

/******************************************************************************
 * Structures
 *****************************************************************************/

/** SDIO Device configuration structure. */
typedef struct
{
    cy_en_sdio_dev_ver_config_t                version;        /**< SDIO protocol version supported. */
    cy_en_sdio_dev_manf_id_config_t            use_default_manfid;    /**< SDIO Device manufacturer ID configuration. If this field is set to
                                             CY_SDIO_DEV_USER_PROVIDED_MANF_ID, SDIO Device uses user provided
                                             manufaturer ID using manfid field. Otherwise, default manufacturer ID. */
    uint32_t                        manfid[CY_SDIO_DEV_MANFID_SIZE];    /**< 6 bytes or 3 tuples of user provided manufacturer ID. This will be used
                                             only when use_default_manfid is set to CY_SDIO_DEV_USER_PROVIDED_MANF_ID */
    cy_en_sdio_dev_blk_size_config_t                    blk_size;                 /**< This field specifies the block size user for function 2 data transferes.
                                             Minimum value is CY_SDIO_DEV_BLK_SIZE_64 and Maximum value CY_SDIO_DEV_BLK_SIZE_512. */
    cy_en_sdio_dev_max_speed_config_t            max_speed_config;    /**< This field specifies maximum speed configuration allowed for this SDIO device.
                                             Minimum value is CY_SDIO_DEV_SDR12 and Maximum value CY_SDIO_DEV_DDR50. */
} cy_stc_sdio_dev_config_t;

/** \cond INTERNAL */

/** Context structure. */
typedef struct
{   
    cy_en_sdio_dev_max_speed_config_t            current_speed_config;    /**< Max speed configuration set */
    cy_en_sdio_dev_blk_size_config_t            current_blk_size;       /**< Minimum value is 1 and Maximum value for F2 supported is 512. */
    cy_cb_sdio_dev_handle_events_t                 cbEvents;
    uint8_t                         *rx_buffer;
    uint32_t                        max_rx_buf_len;
    uint8_t                            *tx_buffer;
    uint32_t                        tx_buf_len;
} cy_stc_sdio_dev_context_t;

/**
 * DMA Descriptor
 * Descriptors are only read by the hardware, never written back.
 */
typedef volatile struct {
    uint32_t    ctrl1;        /**< misc control bits */
    uint32_t    ctrl2;        /**< buffer count and address extension */
    uint32_t    addrlow;    /**< memory address of the date buffer, bits 31:0 */
    uint32_t    addrhigh;    /**< memory address of the date buffer, bits 63:32 */
} cy_stc_sdio_dev_dma_descr_t;

/* Receive Frame Status Header */
typedef volatile struct {
    uint16 len;
    uint16 flags;
} cy_stc_sdio_dev_rx_header_t;

/** \endcond */


/**
* \addtogroup group_sdio_dev_functions
* \{
*/

