ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/include/cy_mxsdiodev.h
/*******************************************************************************
* Function Name: Cy_SDIO_DEV_Init
****************************************************************************//**
*
* This API will initialise MXSDIO IP with the configuration parameters
*
* \param base
* The pointer to a MXSDIODEV instance.
*
* \param *config
* The pointer to the MXSDIO device configuration structure.
*
* \param context
* The pointer to the context structure \ref cy_stc_sdio_dev_context_t allocated
* by the user. The structure is used during the SDIO device operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If using only the SDIO device functions which do not require context, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sdio_dev_status_t
*
*******************************************************************************/
cy_en_sdio_dev_status_t Cy_SDIO_DEV_Init(MXSDIO_Type *base, cy_stc_sdio_dev_config_t const *config, cy_stc_sdio_dev_context_t *context);

/*******************************************************************************
* Function Name: Cy_SDIO_DEV_DeInit
****************************************************************************//**
*
* Restores the MXSDIO block registers back to default.
*
* \param *base
* The pointer to a MXSDIODEV instance.
*
*******************************************************************************/
void Cy_SDIO_DEV_DeInit(MXSDIO_Type *base);

/*******************************************************************************
* Function Name: Cy_SDIO_DEV_Enable
****************************************************************************//**
*
* This API will enable MXSDIODEV IP and allow TX and RX operations
*
* \param base
* The pointer to a MXSDIODEV instance.
*
* \funcusage
*
*******************************************************************************/
cy_en_sdio_dev_status_t Cy_SDIO_DEV_Enable(MXSDIO_Type *base);

/*******************************************************************************
* Function Name: Cy_SDIO_DEV_Disable
****************************************************************************//**
*
* Disables the MXSDIODEV IP from its operation.
* 
* \param base
* The pointer to a MXSDIODEV instance.
*
* \funcusage
*
*******************************************************************************/
cy_en_sdio_dev_status_t Cy_SDIO_DEV_Disable(MXSDIO_Type *base);

/*******************************************************************************
* Function Name: Cy_SD_Host_GetSdStatus
****************************************************************************//**
*
*  Returns the SDIO status from the MXSDIO block.
*
* \param *base
* The pointer to a MXSDIODEV instance.
*
* \param *sdStatus
*  The pointer to store the status of MXSDIO Function 2
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sdio_dev_status_t Cy_SDIO_DEV_GetStatus(MXSDIO_Type const *base, bool *sdStatus);

/*******************************************************************************
* Function Name: Cy_SDIO_DEV_ConfigReadBuf
****************************************************************************//**
*
*  Returns the SDIO status from the MXSDIO block.
*
* \param *base
* The pointer to a MXSDIODEV instance.
*
* \param *buffer
* *buffer
*
* \param *context
* *context
*
* \param size
* size
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sdio_dev_status_t Cy_SDIO_DEV_ConfigReadBuf(MXSDIO_Type const *base, uint8_t *buffer, uint32_t size, cy_stc_sdio_dev_context_t *context);

/*******************************************************************************
* Function Name: Cy_SDIO_DEV_Interrupt
****************************************************************************//**
*
* The Interrupt Service Routine for the MXSDIO. The interrupt code will be
* responsible for the DMA operations on DMA interrupts during ongoing transfers.
* The user must place a call to this interrupt function in the interrupt
* routine corresponding to the interrupt attached to the MXSDIO. If the
* user does not do this, will break: the functionality of all the API functions in
* the MXSDIO driver that use MXSDIO interrupts to affect transfers.
*
* \param base
* The pointer to a MXSDIODEV instance.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* MXSDIODEV block.
*
*******************************************************************************/
void Cy_SDIO_DEV_Interrupt(MXSDIO_Type *base, cy_stc_sdio_dev_context_t *context);

/*******************************************************************************
* Function Name: Cy_SDIO_DEV_RegisterEventCallback
****************************************************************************//**
*
* Registers a callback function that notifies that
* \ref group_sdio_dev_macros_callback_events occurred in the
* \ref Cy_SDIO_DEV_Interrupt.
*
* \param base
* The pointer to the MXSDIO instance.
*
* \param callback
* The pointer to a callback function.
* See \ref cy_cb_sdio_dev_handle_events_t for the function prototype.
*
* \param context
* The pointer to context structure \ref cy_stc_sdio_dev_context_t allocated by
* the user. The structure is used while the SDIO Device operation for internal
* configuration and data retention. The user should not modify anything in
* this structure.
*
* \note
* To remove the callback, pass NULL as the pointer to the callback function.
*
*******************************************************************************/
void Cy_SDIO_DEV_RegisterEventCallback(MXSDIO_Type const *base, cy_cb_sdio_dev_handle_events_t callback, cy_stc_sdio_dev_context_t *context);

/*******************************************************************************
* Function Name: Cy_SDIO_DEV_Transmit_Buffer
****************************************************************************//**
*
* This function is used to transmit data over SDIO interface. This
* function uses the internal DMA to implement the transmit functionality. The
* function sets up an interrupt to trigger the Transmit completion event and at the
* end of the transmission, the callback \ref cy_cb_sdio_dev_handle_events_t is executed.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param buffer
* The pointer to the data to be transferred. First 4 bytes of the buffer
* should be reserved for frame header and actual buffer to be transferredIf
* should start from fifth byte. If this pointer is a NULL, then the
* function returns CY_SDIO_DEV_ERROR.
* 
* \param size
* The size of buffer. Must be > 0 and not greater than 65527.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* MXSDIO_Type block.
*
* \return A status of a transmission.
*       - \ref CY_SDIO_DEV_SUCCESS
*       - \ref CY_SDIO_DEV_ERROR
*
*******************************************************************************/
cy_en_sdio_dev_status_t  Cy_SDIO_DEV_Transmit_Buffer(MXSDIO_Type const *base, uint8_t *buffer, uint16_t size, cy_stc_sdio_dev_context_t *context);

