ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/include/cy_mxsdiodev.h
/*******************************************************************************
* Function Name: Cy_SDIO_DEV_Transmit_Buffer
****************************************************************************//**
*
* This function is used to transmit data over SDIO interface. This
* function uses the internal DMA to implement the transmit functionality. The
* function blocks until the buffer gets transmitted and return to caller.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param buffer
* The pointer to the data to be transferred. First 4 bytes of the buffer
* should be reserved for frame header and actual buffer to be transferredIf
* should start from fifth byte. If this pointer is a NULL, then the
* function returns CY_SDIO_DEV_ERROR.
* 
* \param buf_len buf_len
*
* \return A status of a transmission.
*       - \ref CY_SDIO_DEV_SUCCESS
*       - \ref CY_SDIO_DEV_ERROR
*
*******************************************************************************/
cy_en_sdio_dev_status_t  Cy_SDIO_DEV_Transmit_Buffer_Blocking(MXSDIO_Type const *base, uint8_t *buffer, uint16_t buf_len);

/*******************************************************************************
* Function Name: Cy_SDIO_DEV_Receive_Buffer
****************************************************************************//**
*
* This function is used to receive data over SDIO interface. This
* function uses the internal DMA to implement the receive functionality. The
* function sets up an interrupt to trigger the receive completion event and at the
* end of the reception, the callback \ref cy_cb_sdio_dev_handle_events_t is executed.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* MXSDIO_Type block.
*
* \return A status of a transmission.
*       - \ref CY_SDIO_DEV_SUCCESS
*       - \ref CY_SDIO_DEV_ERROR
*
*******************************************************************************/
cy_en_sdio_dev_status_t  Cy_SDIO_DEV_Receive_Buffer(MXSDIO_Type const *base, cy_stc_sdio_dev_context_t *context);

/*******************************************************************************
* Function Name: Cy_SDIO_DEV_Receive_Buffer_Blocking
****************************************************************************//**
*
* This function is used to receive data over SDIO interface. This
* function uses the internal DMA to implement the receive functionality. The
* function blocks until the buffer received and return to caller.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param buffer
* The pointer to the data received. If this pointer is a NULL, then the
* function returns CY_SDIO_DEV_ERROR.
* 
* \param buf_len
* buf_len
*
* \return A status of a transmission.
*       - \ref CY_SDIO_DEV_SUCCESS
*       - \ref CY_SDIO_DEV_ERROR
*
*******************************************************************************/
cy_en_sdio_dev_status_t Cy_SDIO_DEV_Receive_Buffer_Blocking(MXSDIO_Type const *base, char **buffer, uint32_t *buf_len);

/** \} group_sdio_dev_functions */

/**
* \addtogroup group_sdio_dev_interrupt_functions
* \{
*/
/*******************************************************************************
* Function Name: Cy_SDIO_DEV_GetInterruptStatus
****************************************************************************//**
*
* This function gets the interrupt status information from interrupt status register
*
* \param base
* Holds the base address of the MXSDIO block registers.
*
* \return Returns the interrupt status. 
*
*******************************************************************************/
uint32_t Cy_SDIO_DEV_GetInterruptStatus(MXSDIO_Type const *base);

/*******************************************************************************
* Function Name: Cy_SDIO_DEV_ClearInterrupt
****************************************************************************//**
*
*  Clears the selected MXSDIO interrupt status.
*
* \param *base
* Holds the base address of the MXSDIO block registers.
*
* \param status
*     The bitmask of statuses to clear.
*
*******************************************************************************/
void Cy_SDIO_DEV_ClearInterruptStatus(MXSDIO_Type const *base, uint32_t status);

/*******************************************************************************
* Function Name: Cy_SDIO_DEV_GetInterruptMask
****************************************************************************//**
*
*  Returns which interrupts are masked to cause an interrupt.
*
* \param *base
* Holds the base address of the MXSDIO block registers.
*
* \return uint32_t
* The Bit field of which interrupts are masked to cause an interrupt.
*
*******************************************************************************/
uint32_t Cy_SDIO_DEV_GetInterruptMask(MXSDIO_Type const *base);

/*******************************************************************************
* Function Name: Cy_SDIO_DEV_SetInterruptMask
****************************************************************************//**
*
*  Setting a bit in this register allows the enabled status to cause an interrupt.
*
* \param *base
* Holds the base address of the MXSDIO block registers.
*
* \param interrupt
*  The Bit field of which interrupts can cause an interrupt.
*
*******************************************************************************/
void Cy_SDIO_DEV_SetInterruptMask(MXSDIO_Type const *base, uint32_t interrupt);

/** \} group_sdio_dev_interrupt_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_MXSDIODEV_H */

#endif /* CY_IP_MXSDIODEV */
/** \} group_sdio_dev */

/* [] END OF FILE */
